# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.


my_dict = {"1": "зима", "2": "зима", "3": "весна", "4": "весна", "5": "весна", "6": "лето",
           "7": "лето", "8": "лето", "9": "осень", "10": "осень", "11": "осень", "12": "зима"}

month = str(input("Введите число месяца:"))
if month in my_dict.keys():
    print(my_dict[month])

month = int(input("Введите число месяца:"))
winter = [1, 2, 12]
spring = [3, 4, 5]
autumn = [9, 10, 11]
summer = [6, 7, 8]
if month in winter:
    print('зима')
elif month in spring:
    print('весна')
elif month in summer:
    print('лето')
else:
    print('осень')


